app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'mfarhanathallah031@gmail.com'
 LIMIT 1
---
  public function login()
  {
    if ($this->request->getMethod() == 'post') {
      // Ambil data dari form
      $email = $this->request->getVar('email');
      $password = $this->request->getVar('password');

      // Validasi input
      if (!filter_var($email, FILTER_VALIDATE_EMAIL)) {
        return redirect()->to('/auth/login')->withInput()->with('error', 'Email tidak valid');
      }

      if (empty($password)) {
        return redirect()->to('/auth/login')->withInput()->with('error', 'Password tidak boleh kosong');
      }

      // Autentikasi user
      $userModel = new UserModel();
      $user = $userModel->where('email', $email)->first();

INSERT INTO `users` (`nama`, `jenisKelamin`, `umur`, `noTelp`, `email`, `password`, `created_at`, `updated_at`) VALUES ('MFA', 'Laki - Laki', '100', '088229091174', 'mfarhanathallah031@gmail.com', '$2y$10$EQdJgIBCGKoz5cKjwVlsueoaSovqpFgqZzMjevUUs/ZM1sBVpyBIq', '2023-02-06 05:28:41', '2023-02-06 05:28:41')
---

    $jenisKelamin = $this->request->getVar('jenisKelamin') === 'l' ? 'Laki - Laki' : 'Perempuan';

    $this->userModel->save([
      'nama' => $this->request->getVar('nama'),
      'jenisKelamin' => $jenisKelamin,
      'umur' => $this->request->getVar('umur'),
      'noTelp' => $this->request->getVar('noTelp'),
      'email' => $this->request->getVar('email'),
      'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
    ]);