app/Models/SoalModel.php

  public function getSoal($id = false)
  {
    if ($id == false) {
      return $this->findAll();
---
SELECT *
FROM `soal`